# Считываем количество секунд
n = int(input())

# Так как N может быть больше, чем секунд в сутках (86400),
# берем остаток от деления на количество секунд в сутках.
# Это позволит часам всегда показывать время в пределах от 0 до 23.
n = n % 86400

# Вычисляем количество часов
h = n // 3600

# Вычисляем количество минут
# Сначала находим сколько секунд осталось после вычитания полных часов (n % 3600),
# а затем делим это на 60.
m = (n % 3600) // 60

# Вычисляем количество секунд
# Это остаток от деления общего числа секунд на 60
s = n % 60

# Выводим результат в формате h:mm:ss
# f-строка с параметром :02d гарантирует, что число будет двузначным (дополнится нулем)
print(f"{h}:{m:02d}:{s:02d}")