# Получаем входные данные от пользователя
try:  # это слово для отроботки ошибок
    N = input("Введите число: ")  # Запрашиваем у пользователя ввод числа и сохраняем в переменную N как строку
    number = int(N)  # Преобразуем строку N в целое число и сохраняем в переменную number

    # Находим последнюю цифру числа (с учётом отрицательных чисел)
    abs_number = abs(number)  # Получаем абсолютное значение числа (убираем знак минус)
    last_digit = abs_number % 10  # Находим остаток от деления на 10 - это и будет последняя цифра

    # Выводим результат
    print(last_digit)  # Выводим полученную последнюю цифру на экран

except ValueError: # то ловушка для конкретной ошибки
    print("Ошибка: введите целое число") # это функция для вода текста на экран Ошибка: введите целое число